#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.app_rg: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mazurerm_resource_group.logging_rg: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-logging-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-logging-rg/providers/Microsoft.Insights/components/secfunc-dev-appi001][0m
[0m[1mazurerm_monitor_action_group.monitor_action_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-logging-rg/providers/Microsoft.Insights/actionGroups/secfunc-dev-ag001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/serverFarms/secfunc-dev-asp001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/secfunc-dev-kv001][0m
[0m[1mmodule.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/secfuncdevstg001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/FunctionSubnet][0m
[0m[1mmodule.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/serverFarms/secfunc-dev-asp001][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/serverFarms/secfunc-dev-asp001|applicationLogs-0][0m
[0m[1mdata.azurerm_location.current: Read complete after 2s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/locations/northeurope][0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Reading...[0m[0m
[0m[1mmodule.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-logging-rg/providers/Microsoft.Insights/components/secfunc-dev-appi001][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/secfunc-dev-kv001/providers/Microsoft.Authorization/roleAssignments/93d2c6ee-7ecd-f8ab-6ccb-d5d60819f42e][0m
[0m[1mmodule.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/secfunc-dev-kv001][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/secfunc-dev-kv001|applicationLogs-0][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PeSubnet][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/secfunc-dev-kv001-vault-pe][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Reading...[0m[0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/secfuncdevstg001-blob-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/secfuncdevstg001-queue-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/secfuncdevstg001-table-pe][0m
[0m[1mmodule.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/secfuncdevstg001-file-pe][0m
[0m[1mmodule.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/secfuncdevstg001/providers/Microsoft.Authorization/roleAssignments/ce64fd94-f24b-a6bf-8993-64c837f0c484][0m
[0m[1mmodule.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/secfuncdevstg001][0m
[0m[1mmodule.storage_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_storage_account["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/secfuncdevstg001|applicationLogs-0][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-01T09:28:14Z][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_sample: Refreshing state... [id=https://secfunc-dev-kv001.vault.azure.net/secrets/MySampleSecret/b645336d69ee463c8548de88288511ee][0m
[0m[1mmodule.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-01T09:28:15Z][0m
[0m[1mazapi_resource.function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/sites/secfunc-dev-fctn001][0m
[0m[1mazurerm_role_assignment.function_role_assignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Storage/storageAccounts/secfuncdevstg001/providers/Microsoft.Authorization/roleAssignments/c7560ec9-3db7-6442-1ca7-4035c88f4143][0m
[0m[1mazurerm_private_endpoint.function_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Network/privateEndpoints/secfunc-dev-fctn001-pe][0m
[0m[1mazurerm_role_assignment.function_role_assignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.KeyVault/vaults/secfunc-dev-kv001/providers/Microsoft.Authorization/roleAssignments/5cc02035-49f7-6a7a-5ac0-5b3a5decef16][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_function: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/sites/secfunc-dev-fctn001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_function[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_function" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/sites/secfunc-dev-fctn001"
    }

[1m  # azapi_resource.function[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "function" {
      [33m~[0m[0m body                      = (sensitive value)
        id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/sites/secfunc-dev-fctn001"
        name                      = "secfunc-dev-fctn001"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_monitor_activity_log_alert.monitor_activity_log_alert_service_health[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_activity_log_alert" "monitor_activity_log_alert_service_health" {
      [32m+[0m[0m description         = "Alerts about service health and maintenance events."
      [32m+[0m[0m enabled             = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "global"
      [32m+[0m[0m name                = "secfunc-dev-alert-servicehealth"
      [32m+[0m[0m resource_group_name = "secfunc-dev-logging-rg"
      [32m+[0m[0m scopes              = [
          [32m+[0m[0m "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0",
        ]

      [32m+[0m[0m action {
          [32m+[0m[0m action_group_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-logging-rg/providers/Microsoft.Insights/actionGroups/secfunc-dev-ag001"
          [32m+[0m[0m webhook_properties = {
              [32m+[0m[0m "alert-type"   = "service-health"
              [32m+[0m[0m "environment"  = "dev"
              [32m+[0m[0m "location"     = "northeurope"
              [32m+[0m[0m "severity"     = "Info"
              [32m+[0m[0m "subscription" = "1fdab118-1638-419a-8b12-06c9543714a0"
            }
        }

      [32m+[0m[0m criteria {
          [32m+[0m[0m category = "ServiceHealth"

          [32m+[0m[0m resource_health (known after apply)

          [32m+[0m[0m service_health {
              [32m+[0m[0m events    = [
                  [32m+[0m[0m "Incident",
                  [32m+[0m[0m "Maintenance",
                ]
              [32m+[0m[0m locations = [
                  [32m+[0m[0m "Global",
                  [32m+[0m[0m "North Europe",
                ]
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_function[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_function" {
        id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/secfunc-dev-app-rg/providers/Microsoft.Web/sites/secfunc-dev-fctn001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1mPlan:[0m 1 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>